emacs/emacs-init.org
#+TITLE: init.el
#+AUTHOR: Tom Cammann
#+PROPERTY: header-args:emacs-lisp :tangle ~/.emacs.d/init.el :mkdirp yes :comments link
#+STARTUP: show2levels

* COMMENT Tasks
:PROPERTIES:
:VISIBILITY: folded
:END:
** TODO hl-todo
** TODO doom-dashboard
** TODO file templates
** TODO Terraform
* Intro
:PROPERTIES:
:VISIBILITY: all
:END:
Tangle with =C-c C-v t= or eval the local vars at the bottom to create or update [[file:~/.emacs.d/init.el][~/.emacs.d/init.el]]

Jump from block in this file back here using =M-x org-babel-tangle-jump-to-org=
* Source
** Preamble
#+begin_src emacs-lisp
  ;;; package --- Tom's init.el

  ;;; Commentary:

  ;; DO NOT EDIT: Generated from emacs-init.org 

  ;;; Code:

  ;; Initialize package sources

  (defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
  (require 'package)

  (setq package-archives '(("melpa-stable" . "https://stable.melpa.org/packages/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ))

  (package-initialize)
  (unless package-archive-contents
    (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
  (unless (package-installed-p 'use-package)
    (package-install 'use-package))

  (require 'use-package)
  (setq use-package-always-ensure t)

  ;; NOTE: If you want to move everything out of the ~/.emacs.d folder
  ;; reliably, set `user-emacs-directory` before loading no-littering!
  (setq user-emacs-directory "~/.cache/emacs")

  (use-package no-littering)
  ;; no-littering doesn't set this by default so we must place
  ;; auto save files in the same path as it uses for sessions
  (setq auto-save-file-name-transforms
      `((".*" ,(no-littering-expand-var-file-name "auto-save/") t)))

#+end_src
** GUI 
#+begin_src emacs-lisp
(setq initial-frame-alist
      (append initial-frame-alist
              '((left   . 50)
                (top    . 50)
                (width  . 160)
                (height . 60))))

#+end_src
** UI and Sanity
Make the UI simple and less noisy
#+begin_src emacs-lisp
    ;; Simplify UI

    (setq inhibit-startup-message t)

    ;; Disable tool bar, menu bar, scroll bar.
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (scroll-bar-mode -1)
    (set-fringe-mode 10)        ; Give some breathing room
    (setq scroll-step 1)
    (setq scroll-margin 7)
    ;; Turn off sounds
    (setq ring-bell-function 'ignore)
    (column-number-mode)
    (global-display-line-numbers-mode t)
    (setq-default display-line-numbers-width 5)

    (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
    (save-place-mode 1)

    (set-frame-font "Hasklig 12" nil t)
    ;; (set-frame-font "Monaco 13" nil t)
#+end_src

Set env vars
#+begin_src emacs-lisp

    ;; TODO generate this..
      (setenv "PATH" (concat (getenv "PATH")
"/Users/tcammann/.nvm/versions/node/v12.22.7/bin:/Users/tcammann/.nvm/versions/node/v12.22.7/bin:/Users/tcammann/.nvm/versions/node/v10.24.1/bin:/usr/local/opt/gnu-sed/libexec/gnubin:/usr/local/opt/findutils/libexec/gnubin:/usr/local/opt/coreutils/libexec/gnubin:/usr/local/bin:/usr/local/sbin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/TeX/texbin:/usr/local/go/bin:/Users/tcammann/.pyenv/shims:/Users/tcammann/.nvm/versions/node/v10.24.1/bin:/usr/local/opt/gnu-sed/libexec/gnubin:/usr/local/opt/findutils/libexec/gnubin:/usr/local/opt/coreutils/libexec/gnubin:/Users/tcammann/apache-maven-3.6.3/bin/:/Users/tcammann/Downloads/google-cloud-sdk/bin/:/Users/tcammann/apache-maven-3.6.3/bin/:/Users/tcammann/Downloads/google-cloud-sdk/bin/" ; ":/Users/tom.cammann/.pyenv/shims:/Users/tom.cammann/.pyenv/bin:/usr/local/opt/gnu-sed/libexec/gnubin:/usr/local/opt/findutils/libexec/gnubin:/usr/local/opt/coreutils/libexec/gnubin:/usr/local/bin:/Users/tom.cammann/Downloads/google-cloud-sdk/bin:/usr/local/bin:/usr/bin:/bin:/usr/sbin:/sbin:/Library/TeX/texbin:/Library/Apple/usr/bin:/Library/Frameworks/Mono.framework/Versions/Current/Commands:/Users/tom.cammann/.nvm/versions/node/v11.15.0/bin:/Users/tom.cammann/.pyenv/shims:/Users/tom.cammann/.pyenv/bin:/usr/local/opt/gnu-sed/libexec/gnubin:/usr/local/opt/findutils/libexec/gnubin:/usr/local/opt/coreutils/libexec/gnubin:/Users/tom.cammann/Downloads/google-cloud-sdk/bin:/Users/tom.cammann/Library/Python/3.8/bin:/Users/tom.cammann/go/bin:/Users/tom.cammann/bin:/Users/tom.cammann/Downloads/google-cloud-sdk/bin/:/usr/local/go/bin:/Users/tom.cammann/Library/Python/3.8/bin:/Users/tom.cammann/go/bin:/Users/tom.cammann/bin:/Users/tom.cammann/Downloads/google-cloud-sdk/bin/:/usr/local/go/bin"
  ))


      (setq exec-path (append exec-path (split-string (getenv "PATH") ":")))

#+end_src

** Undo Stuff

#+begin_src emacs-lisp

  ;; (use-package undo-tree
  ;;   :init
  ;;   (global-undo-tree-mode)
  ;;   (setq undo-tree-auto-save-history t)
  ;;   (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo"))))

#+end_src

Undo-fu: linear undo & redo!
#+begin_src emacs-lisp

    (use-package undo-fu
      :after evil
      :init
      (setq evil-undo-system 'undo-fu)
      (setq evil-undo-function 'undo-fu-only-undo)
      (setq evil-redo-function 'undo-fu-only-redo))

  ;; Persistent undo
  (use-package undo-fu-session
    :init
    (global-undo-fu-session-mode)
    :config
    (setq undo-fu-session-incompatible-files '("/COMMIT_EDITMSG\\'" "/git-rebase-todo\\'")))

#+end_src

** Evil
*** Core
#+begin_src emacs-lisp
     (use-package general
       :config
       (general-unbind 'normal "C-f")
       (general-unbind 'emacs "C-f")
       (general-unbind 'insert "C-f")
       )

     ;; evil
     (use-package evil
       :init
       (setq evil-want-integration t)
       (setq evil-want-keybinding nil)
       (setq evil-respect-visual-line-mode t)
       ;; Disable C-i to jump forward to restore TAB functionality in Org mode.
       ;; (setq evil-want-C-i-jump nil)

       ;; (setq evil-want-C-u-scroll t)
       ;; (setq evil-want-C-i-jump nil)
       :config
       (evil-mode 1)
       (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

       (define-key evil-insert-state-map (kbd "C-u") 'evil-scroll-up)
       (define-key evil-normal-state-map (kbd "C-u") 'evil-scroll-up)

       (define-key evil-insert-state-map (kbd "C-p") nil)
       (define-key evil-normal-state-map (kbd "C-p") nil)

       (define-key evil-insert-state-map (kbd "C-n") nil)
       (define-key evil-normal-state-map (kbd "C-n") nil)

       (define-key evil-insert-state-map (kbd "C-e") nil)
       (define-key evil-normal-state-map (kbd "C-e") nil)

       ;; (define-key evil-insert-state-map (kbd "C-f") nil)
       ;; (define-key evil-normal-state-map (kbd "C-f") nil)

       (define-key evil-insert-state-map (kbd "C-b") 'backward-char)
       (define-key evil-insert-state-map (kbd "C-f") 'forward-char)
       (define-key evil-motion-state-map (kbd "C-b") 'backward-char)
       (define-key evil-motion-state-map (kbd "C-f") 'forward-char)

       (define-key evil-motion-state-map (kbd "C-e") 'end-of-line)
       (define-key evil-insert-state-map (kbd "C-a") 'beginning-of-line-text)
       (define-key evil-normal-state-map (kbd "C-a") 'beginning-of-line-text)

       (define-key evil-insert-state-map (kbd "C-b") nil)
       (define-key evil-normal-state-map (kbd "C-b") nil)

       ;; (define-key evil-insert-state-map (kbd "C-i") 'evil-jump-forward)
       ;; (define-key evil-normal-state-map (kbd "C-i") 'evil-jump-forward)

       ;; Disable restore TAB functionality in Org mode.
       (evil-define-key 'normal org-mode-map (kbd "<tab>") #'org-cycle)

       )
#+end_src

