emacs/init.el
     (evil-collection-init))


   (use-package evil-commentary
     :ensure t
     :bind (:map evil-normal-state-map
                 ("gc" . evil-commentary)))

 (use-package evil-visualstar
   :ensure t
     :bind (:map evil-visual-state-map
                 ("*" . evil-visualstar/begin-search-forward)
                 ("#" . evil-visualstar/begin-search-backward)))

 (use-package evil-surround
   :ensure t
   :config
   (global-evil-surround-mode 1))

 (use-package evil-easymotion
   :config
   (evilem-default-keybindings "SPC")
   (evilem-define (kbd "SPC w") 'evil-forward-word-begin)
   (evilem-define (kbd "SPC b") 'evil-backward-word-begin)
   )

;; (use-package evil-org
;;  :ensure t
;;  :after org
;;  :hook (org-mode . (lambda () evil-org-mode))
;;  :config
;;  (require 'evil-org-agenda)
;;  (evil-org-agenda-set-keys))
;; Extras:1 ends here

;; [[file:../org/emacs-init.org::*Core][Core:1]]
(straight-use-package 'org)
(require 'org-tempo)

(defun air-org-skip-subtree-if-priority (priority)
  "Skip an agenda subtree if it has a priority of PRIORITY.

PRIORITY may be one of the characters ?A, ?B, or ?C."
  (let ((subtree-end (save-excursion (org-end-of-subtree t)))
        (pri-value (* 1000 (- org-lowest-priority priority)))
        (pri-current (org-get-priority (thing-at-point 'line t))))
    (if (= pri-value pri-current)
        subtree-end
      nil)))
                                        ; https://blog.aaronbieber.com/2016/09/24/an-agenda-for-life-with-org-mode.html
  (defun air-org-skip-subtree-if-habit ()
    "Skip an agenda entry if it has a STYLE property equal to \"habit\"."
    (let ((subtree-end (save-excursion (org-end-of-subtree t))))
      (if (string= (org-entry-get nil "STYLE") "habit")
          subtree-end
        nil)))

    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python"))

    (use-package org
      :bind
      ("C-c !" . org-time-stamp-inactive)
       :config
       (setq org-export-backends '(ascii html icalendar latex md odt confluence))
       (setq org-agenda-custom-commands
        '(("d" "Daily agenda and all TODOs"
           ((tags "PRIORITY=\"A\""
                  ((org-agenda-skip-function '(org-agenda-skip-entry-if 'todo 'done))
                   (org-agenda-overriding-header "High-priority unfinished tasks:")))
            (agenda "" ((org-agenda-ndays 1)))
            (alltodo ""
                     ((org-agenda-skip-function '(or (air-org-skip-subtree-if-habit)
                                                     (air-org-skip-subtree-if-priority ?A)
                                                     (org-agenda-skip-if nil '(scheduled deadline))))
                      (org-agenda-overriding-header "ALL normal priority tasks:"))))
           ((org-agenda-compact-blocks t)))))
       (setq org-src-fontify-natively t)
       :hook (org-mode . (lambda ()
                          (org-indent-mode)
                         ;; (variable-pitch-mode 1)
                           (visual-line-mode 1)
                            ))
      )


      (org-babel-do-load-languages
       'org-babel-load-languages
       '(
         (shell . t)
         (emacs-lisp . t)
         (org . t)
         (shell . t)
         (C . t)
         (python . t)
         (gnuplot . t)
         (octave . t)
         (R . t)
         (dot . t)
         (awk . t)
         ))

    (setq org-src-fontify-natively t)
    (setq org-src-tab-acts-natively t)

    ;; (setq org-ellipsis "⤵")
    (setq org-ellipsis "▼")
;; Core:1 ends here

;; [[file:../org/emacs-init.org::*Org Extras][Org Extras:1]]
;;  (use-package org-modern)
;;  (use-package org-modern-indent
;;  ;; :load-path "~/code/emacs/org-modern-indent/"
;;  ; or
;;  :straight (org-modern-indent :type git :host github :repo "jdtsmith/org-modern-indent")
;;  :config ; add late to hook
;;  (add-hook 'org-mode-hook #'org-modern-indent-mode 90))

;;  (setq
;; ;; Edit settings
;; org-auto-align-tags nil
;; org-tags-column 0
;; org-catch-invisible-edits 'show-and-error
;; org-special-ctrl-a/e t
;; org-insert-heading-respect-content t

;; ;; Org styling, hide markup etc.
;; org-hide-emphasis-markers t
;; org-pretty-entities t
;; org-ellipsis "…")
;; Org Extras:1 ends here

;; [[file:../org/emacs-init.org::*Org Extras][Org Extras:2]]
(use-package org-brain
  :init
  (with-eval-after-load 'evil
    (evil-set-initial-state 'org-brain-visualize-mode 'emacs))
  :after org)

;; (use-package org-superstar
;;   :after org
;;   :hook (org-mode . (lambda () (org-superstar-mode 1))))

(use-package org-roam
    :after
    org
    :init
    (org-roam-db-autosync-mode)
    :custom
    (org-roam-directory "~/org/roam")
    :bind
    (("C-c n l" . org-roam-buffer-toggle)
    ("C-c n f" . org-roam-node-find)
    ("C-c n i" . org-roam-node-insert))
    :ensure t)

      (use-package org-bullets
      :after org
      :hook (org-mode . org-bullets-mode))
;; Org Extras:2 ends here

;; [[file:../org/emacs-init.org::*Org Extras][Org Extras:3]]
(use-package hide-mode-line)

    (defun efs/presentation-setup ()
      ;; Hide the mode line
      (hide-mode-line-mode 1)

      ;; Display images inline
      (org-display-inline-images) ;; Can also use org-startup-with-inline-images

      ;; Scale the text.  The next line is for basic scaling:
      (setq text-scale-mode-amount 3)
      (text-scale-mode 1))

      ;; This option is more advanced, allows you to scale other faces too
      ;; (setq-local face-remapping-alist '((default (:height 2.0) variable-pitch)
      ;;                                    (org-verbatim (:height 1.75) org-verbatim)
      ;;                                    (org-block (:height 1.25) org-block))))

    (defun efs/presentation-end ()
      ;; Show the mode line again
      (hide-mode-line-mode 0)

      ;; Turn off text scale mode (or use the next line if you didn't use text-scale-mode)
      (text-scale-mode 0)

      ;; If you use face-remapping-alist, this clears the scaling:
      ;; (setq-local face-remapping-alist '((default variable-pitch default)))
)

    (use-package org-tree-slide
      :after org
      :hook ((org-tree-slide-play . efs/presentation-setup)
             (org-tree-slide-stop . efs/presentation-end))
      :custom
      (org-tree-slide-slide-in-effect t)
      (org-tree-slide-activate-message "Presentation started!")
      (org-tree-slide-deactivate-message "Presentation finished!")
      (org-tree-slide-header t)
      (org-tree-slide-breadcrumbs " > ")
      (org-image-actual-width nil))
;; Org Extras:3 ends here

;; [[file:../org/emacs-init.org::*Org Extras][Org Extras:4]]
(add-to-list 'safe-local-variable-values '(eval add-hook 'after-save-hook (lambda nil (org-babel-tangle)) nil t))
(add-to-list 'safe-local-variable-values '(org-confirm-babel-evaluate))
;; Org Extras:4 ends here

;; [[file:../org/emacs-init.org::*GNUPlot support][GNUPlot support:1]]
(use-package gnuplot-mode)
(use-package gnuplot)
;; GNUPlot support:1 ends here

;; [[file:../org/emacs-init.org::*Calendar][Calendar:1]]
;; (use-package calfw)
;; Calendar:1 ends here

;; [[file:../org/emacs-init.org::*Themes & Icons & Dashboard][Themes & Icons & Dashboard:1]]
(use-package doom-themes
  :init (load-theme 'doom-one t))

(use-package all-the-icons
  :ensure t
)

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 15)))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
;; Themes & Icons & Dashboard:1 ends here
