emacs/emacs-init.org
** Help Packages
#+begin_src emacs-lisp
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.5))

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key)
    )

#+end_src

** Ivy & Counsel
#+begin_src emacs-lisp
    (use-package ivy
      :diminish
      ;; :bind (("C-s" . swiper)
      ;; 	:map ivy-minibuffer-map
      ;; 	("TAB" . ivy-alt-done)
      ;; 	("C-l" . ivy-alt-done)
      ;; 	("C-j" . ivy-next-line)
      ;; 	("C-k" . ivy-previous-line)
      ;; 	:map ivy-switch-buffer-map
      ;; 	("C-k" . ivy-previous-line)
      ;; 	("C-l" . ivy-done)
      ;; 	("C-d" . ivy-switch-buffer-kill)
      ;; 	:map ivy-reverse-i-search-map
      ;; 	("C-k" . ivy-previous-line)
      ;; 	("C-d" . ivy-reverse-i-search-kill))
      :config
      (ivy-mode 1)
      ;; The default sorter is much to slow and the default for `ivy-sort-max-size'
      ;; is way too big (30,000). Turn it down so big repos affect project
      ;; navigation less.
      (setq ivy-sort-max-size 7500)
      :init
      (let ((standard-search-fn #'+ivy-prescient-non-fuzzy)
               ;; #'ivy--regex-plus)
            (alt-search-fn #'ivy--regex-fuzzy))
               ;; Ignore order for non-fuzzy searches by default
               ;; #'ivy--regex-ignore-order)))
        (setq ivy-re-builders-alist
              `((counsel-rg     . ,standard-search-fn)
                (swiper         . ,standard-search-fn)
                (swiper-isearch . ,standard-search-fn)
                (t . ,alt-search-fn))
              ivy-more-chars-alist
              '((counsel-rg . 1)
                (counsel-search . 2)
                (t . 3))))
    )

    (setq ivy-sort-max-size 7500)

    (use-package counsel
      :bind (("C-M-j" . 'counsel-switch-buffer)
             ("C-c r" . counsel-recentf)
             :map minibuffer-local-map
             ("C-r" . 'counsel-minibuffer-history))
      :config
      (counsel-mode 1))

    (use-package ivy-rich
      :init
      (ivy-rich-mode 1))

    ;; This Prescient configuration is optimized for use in System
    ;; Crafters videos and streams, check out the
    ;; [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more
    ;; details on how to configure it!

    (use-package prescient)
    (use-package ivy-prescient
      :after counsel
      :custom
      (ivy-prescient-enable-filtering nil)
      :config
      (prescient-persist-mode 1)
      (ivy-prescient-mode 1))

    (use-package flx
      :defer t  ; is loaded by ivy
      :init (setq ivy-flx-limit 10000))

  (use-package all-the-icons-ivy
    :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))
#+end_src

** Projectile
#+begin_src emacs-lisp
  (use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/git/")
      (setq projectile-project-search-path '("~/git/")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

(use-package ag)
#+end_src

** Company (auto-complete)
#+begin_src emacs-lisp

(use-package company
  :bind
  ("M-n" . comany-complete)
  :config
  (company-mode t))

(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src

** Git

#+begin_src emacs-lisp
  (use-package magit)

 (use-package diff-hl
    :ensure t
    :defer 1
    :diminish
    :init
    :config
    ;; Highlight changes to the current file in the fringe
    ;; (add-hook 'prog-mode-hook #'diff-hl-mode)
    ;; (add-hook 'org-mode-hook #'diff-hl-mode)
    (global-diff-hl-mode)
    ;; Highlight changed files in the fringe of Dired
    (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
    ;; Fall back to the display margin, if the fringe is unavailable
    ;; (unless (display-graphic-p) (diff-hl-margin-mode))
    ;; (setq diff-hl-fringe-bmp-function 'diff-hl-fringe-bmp-from-type)
    (diff-hl-margin-mode)
    (setq diff-hl-margin-side 'right)
    )
#+end_src
#+begin_src emacs-lisp
(use-package git-link)
(use-package git-timemachine)
#+end_src

** LSP
#+begin_src emacs-lisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)
#+end_src

** Dired
#+begin_src emacs-lisp
  (use-package dired
  :straight (:type built-in)
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  ;; :custom ((dired-listing-switches "-agho --group-directories-first"))
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-single-up-directory
      "l" 'dired-single-buffer))

    (use-package dired-single)

    (use-package all-the-icons-dired
      :hook (dired-mode . all-the-icons-dired-mode))

#+end_src

** Terminal
#+begin_src emacs-lisp
(use-package vterm)
#+end_src

** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))
#+end_src

** Flyspell
#+begin_src emacs-lisp
(use-package flyspell
  :config
  (setq ispell-program-name "/usr/local/bin/aspell")
  :init
  (progn
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    (add-hook 'text-mode-hook 'flyspell-mode)
    ))
#+end_src

** Whitespace
#+begin_src emacs-lisp
(use-package whitespace
  :ensure t
  :diminish whitespace-mode
  ;; :init
  ;; (add-hook 'prog-mode-hook 'whitespace-mode)
  )

#+end_src

** Languages
*** Python
#+begin_src emacs-lisp
  (setq python-interpreter "/Users/tcammann/.pyenv/shims/python")
  (setq python-shell-interpreter "/Users/tcammann/.pyenv/shims/python")
  ;; (use-package python-mode)
  ;; (use-package pyenv-mode)
  (use-package lsp-pyright
    :ensure t
    :hook (python-mode . (lambda ()
                            (require 'lsp-pyright)
                            (lsp))))  ; or lsp-deferred
#+end_src
*** Json
#+begin_src emacs-lisp
(use-package json-mode)
#+end_src
*** Yaml
#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src
*** Markdown
#+begin_src emacs-lisp
(use-package markdown-mode)
#+end_src
*** HTML/CSS/JS
#+begin_src emacs-lisp
(use-package web-mode)
#+end_src
*** Jsonnet
#+begin_src emacs-lisp
(use-package jsonnet-mode)
#+end_src
*** Graphviz
#+begin_src emacs-lisp
(use-package graphviz-dot-mode
  :ensure t
  :config
  (setq graphviz-dot-indent-width 4))
#+end_src
** AI
*** ChatGPT
Doesn't support API access yet...
#+begin_src emacs-lisp
  ;; (use-package chatgpt
  ;;   :straight (:host github :repo "joshcho/ChatGPT.el" :files ("dist" "*.el"))
  ;;   :init
  ;;   (require 'python)
  ;;   (setq chatgpt-repo-path "~/.emacs.d/straight/repos/ChatGPT.el/")
  ;;   :bind ("C-c q" . chatgpt-query))
#+end_src
*** CodeGPT
#+begin_src emacs-lisp
;; (use-package openai
  ;; :straight (openai :type git :host github :repo "emacs-openai/openai"))
;; (use-package codegpt
  ;; :straight (codegpt :type git :host github :repo "emacs-openai/codegpt"))
#+end_src
* COMMENT Local Variables
# Local Variables:
# eval: (add-hook 'after-save-hook (lambda ()(org-babel-tangle)) nil t)
# End:
