emacs/init.el

;; [[file:../org/emacs-init.org::*Help Packages][Help Packages:1]]
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.5))

(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key)
  )
;; Help Packages:1 ends here

;; [[file:../org/emacs-init.org::*Ivy & Counsel][Ivy & Counsel:1]]
(use-package ivy
    :diminish
    ;; :bind (("C-s" . swiper)
    ;; 	:map ivy-minibuffer-map
    ;; 	("TAB" . ivy-alt-done)
    ;; 	("C-l" . ivy-alt-done)
    ;; 	("C-j" . ivy-next-line)
    ;; 	("C-k" . ivy-previous-line)
    ;; 	:map ivy-switch-buffer-map
    ;; 	("C-k" . ivy-previous-line)
    ;; 	("C-l" . ivy-done)
    ;; 	("C-d" . ivy-switch-buffer-kill)
    ;; 	:map ivy-reverse-i-search-map
    ;; 	("C-k" . ivy-previous-line)
    ;; 	("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1)
    ;; The default sorter is much to slow and the default for `ivy-sort-max-size'
    ;; is way too big (30,000). Turn it down so big repos affect project
    ;; navigation less.
    (setq ivy-sort-max-size 7500)
    :init
    (let ((standard-search-fn #'+ivy-prescient-non-fuzzy)
             ;; #'ivy--regex-plus)
          (alt-search-fn #'ivy--regex-fuzzy))
             ;; Ignore order for non-fuzzy searches by default
             ;; #'ivy--regex-ignore-order)))
      (setq ivy-re-builders-alist
            `((counsel-rg     . ,standard-search-fn)
              (swiper         . ,standard-search-fn)
              (swiper-isearch . ,standard-search-fn)
              (t . ,alt-search-fn))
            ivy-more-chars-alist
            '((counsel-rg . 1)
              (counsel-search . 2)
              (t . 3))))
  )

  (setq ivy-sort-max-size 7500)

  (use-package counsel
    :bind (("C-M-j" . 'counsel-switch-buffer)
           ("C-c r" . counsel-recentf)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

  (use-package ivy-rich
    :init
    (ivy-rich-mode 1))

  ;; This Prescient configuration is optimized for use in System
  ;; Crafters videos and streams, check out the
  ;; [[https://youtu.be/T9kygXveEz0][video on prescient.el]] for more
  ;; details on how to configure it!

  (use-package prescient)
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))

  (use-package flx
    :defer t  ; is loaded by ivy
    :init (setq ivy-flx-limit 10000))

(use-package all-the-icons-ivy
  :init (add-hook 'after-init-hook 'all-the-icons-ivy-setup))
;; Ivy & Counsel:1 ends here

;; [[file:../org/emacs-init.org::*Projectile][Projectile:1]]
(use-package projectile
    :diminish projectile-mode
    :config (projectile-mode)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    ;; NOTE: Set this to the folder where you keep your Git repos!
    (when (file-directory-p "~/git/")
      (setq projectile-project-search-path '("~/git/")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :config (counsel-projectile-mode))

(use-package ag)
;; Projectile:1 ends here

;; [[file:../org/emacs-init.org::*Company (auto-complete)][Company (auto-complete):1]]
(use-package company
  :bind
  ("M-n" . comany-complete)
  :config
  (company-mode t))

(use-package company-box
  :hook (company-mode . company-box-mode))
;; Company (auto-complete):1 ends here

;; [[file:../org/emacs-init.org::*Git][Git:1]]
(use-package magit)

(use-package diff-hl
   :ensure t
   :defer 1
   :diminish
   :init
   :config
   ;; Highlight changes to the current file in the fringe
   ;; (add-hook 'prog-mode-hook #'diff-hl-mode)
   ;; (add-hook 'org-mode-hook #'diff-hl-mode)
   (global-diff-hl-mode)
   ;; Highlight changed files in the fringe of Dired
   (add-hook 'dired-mode-hook 'diff-hl-dired-mode)
   ;; Fall back to the display margin, if the fringe is unavailable
   ;; (unless (display-graphic-p) (diff-hl-margin-mode))
   ;; (setq diff-hl-fringe-bmp-function 'diff-hl-fringe-bmp-from-type)
   (diff-hl-margin-mode)
   (setq diff-hl-margin-side 'right)
   )
;; Git:1 ends here

;; [[file:../org/emacs-init.org::*Git][Git:2]]
(use-package git-link)
(use-package git-timemachine)
;; Git:2 ends here

;; [[file:../org/emacs-init.org::*LSP][LSP:1]]
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))

(use-package lsp-treemacs
  :after lsp)

(use-package lsp-ivy)
;; LSP:1 ends here

;; [[file:../org/emacs-init.org::*Dired][Dired:1]]
(use-package dired
:straight (:type built-in)
:ensure nil
:commands (dired dired-jump)
:bind (("C-x C-j" . dired-jump))
;; :custom ((dired-listing-switches "-agho --group-directories-first"))
:config
(evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-single-up-directory
    "l" 'dired-single-buffer))

  (use-package dired-single)

  (use-package all-the-icons-dired
    :hook (dired-mode . all-the-icons-dired-mode))
;; Dired:1 ends here

;; [[file:../org/emacs-init.org::*Terminal][Terminal:1]]
(use-package vterm)
;; Terminal:1 ends here

;; [[file:../org/emacs-init.org::*Flycheck][Flycheck:1]]
(use-package flycheck
  :ensure t
  :init (global-flycheck-mode))
;; Flycheck:1 ends here

;; [[file:../org/emacs-init.org::*Flyspell][Flyspell:1]]
(use-package flyspell
  :config
  (setq ispell-program-name "/usr/local/bin/aspell")
  :init
  (progn
    (add-hook 'prog-mode-hook 'flyspell-prog-mode)
    (add-hook 'text-mode-hook 'flyspell-mode)
    ))
;; Flyspell:1 ends here

;; [[file:../org/emacs-init.org::*Whitespace][Whitespace:1]]
(use-package whitespace
  :ensure t
  :diminish whitespace-mode
  ;; :init
  ;; (add-hook 'prog-mode-hook 'whitespace-mode)
  )
;; Whitespace:1 ends here

;; [[file:../org/emacs-init.org::*Python][Python:1]]
(setq python-interpreter "/Users/tcammann/.pyenv/shims/python")
(setq python-shell-interpreter "/Users/tcammann/.pyenv/shims/python")
;; (use-package python-mode)
;; (use-package pyenv-mode)
(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred
;; Python:1 ends here

;; [[file:../org/emacs-init.org::*Json][Json:1]]
(use-package json-mode)
;; Json:1 ends here

;; [[file:../org/emacs-init.org::*Yaml][Yaml:1]]
(use-package yaml-mode)
;; Yaml:1 ends here

;; [[file:../org/emacs-init.org::*Markdown][Markdown:1]]
(use-package markdown-mode)
;; Markdown:1 ends here

;; [[file:../org/emacs-init.org::*HTML/CSS/JS][HTML/CSS/JS:1]]
(use-package web-mode)
;; HTML/CSS/JS:1 ends here

;; [[file:../org/emacs-init.org::*Jsonnet][Jsonnet:1]]
(use-package jsonnet-mode)
;; Jsonnet:1 ends here

;; [[file:../org/emacs-init.org::*Graphviz][Graphviz:1]]
(use-package graphviz-dot-mode
  :ensure t
  :config
  (setq graphviz-dot-indent-width 4))
;; Graphviz:1 ends here

;; [[file:../org/emacs-init.org::*CodeGPT][CodeGPT:1]]
;; (use-package openai
  ;; :straight (openai :type git :host github :repo "emacs-openai/openai"))
;; (use-package codegpt
  ;; :straight (codegpt :type git :host github :repo "emacs-openai/codegpt"))
;; CodeGPT:1 ends here
